// Поділ відповідальності

// Зберігати код, пов'язаний з HTTP-запитом, безпосередньо в компоненті - не найкраща практика. У застосунку буде багато різних запитів до бекенду, можливо навіть до декількох різних бекендів, і вони будуть використовуватися в різних компонентах. До того ж код HTTP-запитів може бути складним та громіздким.

// Щоб розтягнути файли компонентів і спростити майбутній рефакторинг, створимо додатковий файл articles-api.js всередині папки src. У цьому файлі будемо зберігати функції для HTTP-запитів до бекенду із статтями.
import axios from "axios";

axios.defaults.baseURL = "https://hn.algolia.com/api/v1";
export const fetchArticlesWithTopic = async (topic) => {
  const reponse = await axios.get(`/search?query=${topic}`);
  return reponse.data.hits;
};

// Оголошуємо асинхронну функцію (async/await) отримання списку статей за заголовком.
// Функція виконує HTTP-запит і повертає його результат - проміс із даними.
// Обробка помилки запиту не входить до тіла функції, це виконується в місці її використання, тобто в компоненті.
